package gameAll.define
{
   public class DialogueDefine
   {
      
      public var text:Object = new Object();
      
      public var tip:Array = [];
      
      public function DialogueDefine()
      {
         super();
         this.text.d1_0_1 = "投降吧，人类，你们的抵抗软弱无力！";
         this.text.d1_0_2 = "不，我还可以战斗…啊…";
         this.text.d1_3_1 = "令人讨厌的虫子，突击者队长，消灭他！";
         this.text.d1_3_2 = "不要失败了，否则你的下场就会和你的兄弟一样。";
         this.text.d1_3_3 = "你这是自寻死路！";
         this.text.d1_3_4 = "人类比我想象的要强大，但是机器人的大军会将你们吞噬殆尽！";
         this.text.d1_3_5 = "快上来，player，我将带你前往目的地。";
         this.text.d1_6_1 = "你们的毅力值得赞赏，但很快你们就将加入死者的行列了！";
         this.text.d1_6_2 = "碾压者，将他们统统碾碎！";
         this.text.d1_6_3 = "逃啊，你逃啊，无论逃到哪里，我都将把你碾碎！";
         this.text.d1_6_4 = "齿轮卡…住了吗…";
         this.text.d2_3_1 = "我是这艘战舰的指挥官，无论发生什么事情，我都将与这艘战舰共存亡！";
         this.text.d2_3_2 = "士兵们，进攻！";
         this.text.d2_3_3 = "先知，我战斗到了最后一刻…";
         this.text.d2_5_1 = "杀戮，更多的杀戮！";
         this.text.d2_5_2 = "你最终逃不过机器人大军的审判的！";
         this.text.d2_6_1 = "你们为什么还要坚持下去，难道你们不明白这样做毫无意义吗？";
         this.text.d2_6_3 = "给你一个忠告。现在就加入我们，还来得及！";
         this.text.d2_6_4 = "顺从未来的人是看不见希望之光的。我不会背离我的正义！";
         this.text.d2_6_5 = "蠢货！终有一天你会知道你干了多蠢的事情…";
         this.text.d2_7_1 = "人类，无论如何，你们都会坚持不懈的，是不是？";
         this.text.d2_7_2 = "如果死亡是我的命运，我将欣然接受，但是！至少不是今天！";
         this.text.d2_7_3 = "很好，迎接死亡的拥抱吧！";
         this.text.d2_7_4 = "我的大军会让你在接下去的每一秒都更加痛苦！";
         this.text.d2_7_5 = "不知道痛苦的人是不会知道什么是和平的。";
         this.text.d3_3_1 = "嗯！叛乱？可笑，你们以为可以过了我这一关吗？";
         this.text.d3_3_2 = "血肉之躯，看你如何抵挡我的攻击。";
         this.text.d3_3_3 = "呼救…呼救…";
         this.text.d3_5_1 = "进攻！战士们！让他们付出代价！";
         this.text.d3_5_2 = "难道进攻不是最好的防御么？";
         this.text.d3_6_1 = "杰克，你为何要背叛人类？";
         this.text.d3_6_2 = "你不会了解的，这个世界正在毁灭的边缘徘徊，光靠你们是无法拯救这个世界的。";
         this.text.d3_6_3 = "兄弟，加入我们吧，只有我们才能拯救这个世界。";
         this.text.d3_6_4 = "我拒绝，而且，我也不会眼睁睁看着你一错再错。";
         this.text.d3_6_5 = "从我们接受训练开始，你我始终是形影不离的搭档。";
         this.text.d3_6_6 = "历经无数次战斗，出生入死那么多次，我怎么也没有想到会有兵戎相见的一天。";
         this.text.d3_6_7 = "我也不曾想到，今天，无论如何我都要阻止你！";
         this.text.d3_6_8 = "来吧，让我们一决胜负！";
         this.text.d3_6_9 = "你和我如同硬币的两面，当我们彼此面对时,就会看到真实的自己。";
         this.text.d3_6_10 = "或许有相同之处，但我们永远不可能面向着同一方，谢谢你，我的兄弟，也许这就是我的归宿…";
         this.text.d3_8_1 = "我听说过你，人类的战士。正如传言中的一样，你拥有非凡的勇气。";
         this.text.d3_8_2 = "但是今天，你逃不过我的剑！";
         this.text.d3_8_3 = "在此之前，你要先躲过我的子弹。";
         this.text.d3_8_4 = "能够与你这样的对手一战，这真是我的荣幸。";
         this.text.d4_3_1 = "没有人可以活着离开这里！";
         this.text.d4_3_2 = "阵地…被攻破了…";
         this.text.d4_4_1 = "啊，羊入虎口！";
         this.text.d4_4_2 = "贝塔，我感觉到了你的痛苦！";
         this.text.d4_4_3 = "就像是飞蛾扑火！";
         this.text.d4_4_4 = "舒克，不…";
         this.text.d4_5_1 = "你们正在进行一场注定要失败的战争！";
         this.text.d4_5_2 = "逃跑吧，或许这样你们还可以多活几天！";
         this.text.d4_5_3 = "我的主人…将会…！";
         this.text.d4_6_1 = "你曾是超合金战队的英雄，达利安上校，你怎么可以背叛人类。";
         this.text.d4_6_2 = "player，你以为你们所做的一切都是正确的吗？";
         this.text.d4_6_3 = "巨大的黑影笼罩着这个世界，末日已经来临，而你正在摧毁我们可以唯一幸存下来的机会！";
         this.text.d4_6_4 = "多说无益，我会将你带回联邦法庭接受审判！";
         this.text.d4_6_5 = "我不懂！为什么我会失败！ 我明明拥有强于你的力量！";
         this.text.d4_6_6 = "失去了正义的同时你就已经失去了力量。这…就是你失败的原因。";
         this.text.d4_6_7 = "player，我…看到…的未来…只有…绝望，人类终将会被自己孕育出的黑暗所吞噬！";
         this.text.d4_6_8 = "即使在无尽的黑暗中，人类也可以依靠友情和信赖的灯火照亮前方的道路，携手并肩前进！";
         this.text.d4_6_9 = "这就是…我们真正的力量！";
         this.text.d4_7_1 = "我们又见面了，人类！";
         this.text.d4_7_2 = "这一次你逃不掉了，你需要为中尉的死付出代价！";
         this.text.d4_7_3 = "原来你还活在过去的阴影中呢？真是有趣！";
         this.text.d4_7_4 = "无法挽回的，就是过去。而你无法击败的，就是正义！";
         this.text.d4_7_5 = "那就来吧！";
         this.text.d4_7_6 = "你们…的挣扎…毫无意义";
         this.text.d4_7_7 = "罗杰中尉，你可以安息了。";
         this.text.d4_9_1 = "无须恐惧，因为等待着你的只有死亡一途。";
         this.text.d4_9_2 = "我来到这个战场，就不曾畏惧死亡。正义将引领我们走向胜利！";
         this.text.d4_9_3 = "很好，我就解除无谓的幻象，让你见识一下机器人霸主的真面目！";
         this.text.d4_9_6 = "别高兴的太早…很快，我将卷土重来，机器人终将统治这个世界！";
         this.text.k1_1_1 = "我是第八军团空军指挥官，你无法击败我的！";
         this.text.k1_1_2 = "荣耀归于我主！";
         this.text.k1_2_1 = "你以为你的计划非常成功，却不知你已经踏入了死亡的领域！";
         this.text.k1_2_2 = "出来吧，我的侍卫吧！将他们的碎片带回来见我！";
         this.text.k1_3_1 = "既然你们这么迫不及待的想要见识我的力量，那么，我就成全你！";
         this.text.k1_3_2 = "地球人，你们并不孤独，我们的舰队马上就会进入太阳系……净化即将来临……";
         this.text.k1_7_1 = "冲锋，战士们，杀死他们，将他们的头颅带来给我！";
         this.text.k1_7_2 = "敌人的地面部队冲上来了，伙计们，进入攻城模式，将他们轰成渣！";
         this.text.k1_7_3 = "他们的防线太坚固了，空军部队，轰炸他们。";
         this.text.k1_7_4 = "敌人又上来了，天隼战机，起飞迎敌。";
         this.text.k1_7_5 = "你们的防御无法阻止我！！";
         this.text.k1_8_1 = "看到没，真是一个大家伙，给我两分钟时间，我来想想这么破坏它的防护盾！";
         this.text.k1_8_2 = "搞定！我们走吧，这个家伙马上就要爆炸了！";
         this.text.k1_9_1 = "小子，我就知道你能拿下那座高地，怎么样，准备好再次投入战斗了吗？";
         this.text.k1_9_2 = "是的，有什么我可以做的吗？";
         this.text.k1_9_3 = "这一次负责进攻北线的是敌人第八军团的机械化部队，";
         this.text.k1_9_4 = "就是与我们在『南斯城』中交手的那一批，";
         this.text.k1_9_5 = "上一次让他们从我手下溜走，这一次，我们一定要将他们彻底消灭。";
         this.text.k1_9_6 = "好的，我会立刻召集『火鹰』战队。";
         this.text.k1_10_1 = "小心，这是一个陷阱，离开这里，快！";
         this.text.k1_10_2 = "太迟了，我就知道一定会有人来救这个叛徒。";
         this.text.k1_10_3 = "又是你，上次让你从我手下逃走，这一次，我绝不会让这样的事情再次发生。";
         this.text.k1_10_4 = "杀死他们，我来对付他。";
         this.text._g0101 = "那是什么？";
         this.text._g0102 = "很好，你们至今为止的一切都做得很好。但是，很遗憾，你即将成为下一个在我手中消失的超合金战车。";
         this.text._g0103 = "不论你有多强，我也会打败你。来吧！";
         this.text._g0104 = "哈哈哈哈，很好，真是太好了，能把我打败的，只有...只有...你...很好...";
         this.text._g0201 = "放弃抵抗吧，在我面前，你根本没有胜算。我不想杀像你一样的战士。";
         this.text._g0202 = "我的身后关系着人类的存亡，所以，你的好意我心领了。";
         this.text._g0203 = "那就接受死亡吧，放心，我会让你死得痛快。";
         this.text._g0204 = "这不可能！为什么，为什么！";
         this.text._g0205 = "因为我肩负的是希望，你带来的只有绝望，而希望却总能战胜绝望。";
         this.text._g0206 = "不...";
         this.text._g0301 = "我终于等到你了。接下来，只要消灭你，一切都结束了。";
         this.text._g0302 = "要被消灭的是你！";
         this.text._g0303 = "有胆识！我欣赏有胆识的人。不过，我已经决定了，死亡才是你的归宿。";
         this.text._g0304 = "受死吧，接下我最强的一击吧！。";
         this.text._g0305 = "任务完成，紧急撤退！";
         this.text._g0306 = "哼，原来以为是狮子到头来是老鼠吗？";
         this.text._g0401 = "目标锁定，开始清除！";
         this.text._g0402 = "请求支援！请求支...";
         this.text._g0501 = "鼠辈，你又来了？这次我可不会让你逃走了。";
         this.text._g0502 = "这句话是我想对你说的！你已经无处可逃了。";
         this.text._g0503 = "逃？哈哈哈，我从来不知道“逃”是什么意思！";
         this.text._g0504 = "战无不胜，不胜即死！这就是我的准则。死吧！";
         this.text._g0505 = "原来，你果然是狮子吗？不过你要当心，我们都是棋子，真正的敌人隐藏在...";
         this.text._g0601 = "放马过来，我不会让你继续前进的！";
         this.text._g0602 = "我失败了...机器人军团必胜！";
         this.text._g0701 = "你以为你们会获得胜利吗？天真！接下来，我来告诉你，什么叫做真正的绝望！嘎嘎嘎嘎！";
         this.text._g0702 = "连我...都无法阻止你吗？太强了，实在太强了！不过，你们最后面对的只会是失败！嘎嘎嘎嘎！";
         this.text._g0801 = "又有无知的小老鼠跑进来了，你们以为还走得掉吗？哇哈哈，通通去死吧！";
         this.text._g0802 = "可恶，可恶！你们会为此付出代价的！机械路霸会把你们切成碎片！";
         this.text._g0901 = "什么嘛！都是一些小虫子，不给力，太不给力了！";
         this.text._g0902 = "啊？我失败了吗？真无聊，这是太无聊了！";
         this.text._g1001 = "我知道，终有一天，你我会有一战，看来就是今天了。";
         this.text._g1002 = "不过，现在的你，还不是我的对手。那么，就来享受这最后的黑暗时刻吧。";
         this.text._g1003 = "黑暗是不会消失的...";
         this.text._g1004 = "什么意思？";
         this.text._g1005 = "有光明的地方就有黑暗，你消灭了一个机器人，会有更多的机器人等着你。终有一天，你也会迎接自己的黑暗。";
         this.text._g1006 = "如果这是我的命运，那我欣然接受！";
         this.text._g1007 = "我终于知道，为什么你可以一直战斗到现在了！";
         this.text._g1008 = "哈哈哈！我真希望能看到你能走到多远，可惜，现在，没有机会了。";
      }
      
      public function getRandomTip() : String
      {
         return "";
      }
   }
}

